
// Start4.1_Grade.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
	int grade;
	cout << "Enter your grade (1-5): ";
	cin >> grade;
	switch (grade) {
		case 1:
		cout << "Fail" << endl;
		break;
		case 2:
			cout << "Poor" << endl;
			break;
		case 3:
			cout << "Satisfactory" << endl;
			break;
		case 4:
		cout << "Good" << endl;
		break;
		case 5:
			cout << "Excellent" << endl;
			break;
		default:
			cout << "Invalid grade" << endl;
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
